cask_args appdir: '/Applications'

tap 'homebrew/bundle'
tap 'puma/puma'
tap 'spotify/sptaps', "git@ghe.spotify.net:shared/homebrew-spotify.git"
tap 'romkatv/powerlevel10k'

brew 'ack'
brew 'bat'
brew 'coreutils'
brew 'diff-so-fancy'
brew 'direnv'
brew 'fzf'
brew 'git-crypt'
brew 'git-lfs'
brew 'git-filter-repo'
brew 'go'
brew 'gpg'
brew 'graphicsmagick'
brew 'grc'
brew 'grpcurl'
brew 'helm'
brew 'htop'
brew 'httpie'
brew 'imagemagick'
brew 'jp2a'
brew 'jq'
brew 'libgit2'
brew 'librsvg'
brew 'maven'
brew 'ncdu'
brew 'nvm'
brew 'openssl'
brew 'pkg-config'
brew 'prettyping'
brew 'puma/puma/puma-dev'
brew 'rbenv'
brew 'readline'
brew 'romkatv/powerlevel10k/powerlevel10k'
brew 'roundup'
brew 'ruby-build'
brew 'shpotify'
brew 'spaceman-diff'
brew 'spark'
brew 'spotify/sptaps/hmtools'
brew 'tldr'
brew 'vim'
brew 'watchman'
brew 'wget'
brew 'yarn'
brew 'youtube-dl'

tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'

cask 'adium'
cask 'alfred'
cask 'atom'
cask 'discord'
cask 'figma'
cask 'google-cloud-sdk'
cask 'handbrake'
cask 'intellij-idea'
cask 'iterm2'
cask 'jumpcut'
cask 'rectangle'
cask 'slack'
cask 'transmission'
cask 'tunnelbear'
cask 'telegram'
cask 'vlc'
